Revit 2026 API

# StonePatternType Enumeration

---

The enumerated type representing the permitted values for the asset property "StonePattern" from the "Stone" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum StonePatternType
```
```vb
Public Enumeration StonePatternType
```
```cpp
public enum class StonePatternType
```
```fsharp
type StonePatternType
```

| Member name | Value | Description |
| --- | --- | --- |
| Custom | 1 |  |
| None | 0 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace